Documents/ЗакупкаППЛО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗакупкаППЛО</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правообладатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПравообладателю</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопОтКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопОтВендора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПравоОбл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакупкаППЛО/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗадачиПроектов") Тогда
		// Заполнение шапки
		ЗадачаПроекта 		= ДанныеЗаполнения.Ссылка;
		Проект				= ЗадачаПроекта.Владелец;
		//
		ВидНоменклатуры		= ЗадачаПроекта.ТиповаяЗадача.ВидНоменклатуры;  
		Правообладатель		= ВидНоменклатуры.Правообладатель;  
	КонецЕсли;
	ИсполнительДокумента 		= ПараметрыСеанса.ТекущийПользователь;
	ДатаОплатыПравообладателю	= ТекущаяДата();
	ДатаОплатыКлиента			= ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//  + месяц - проект
	Движения.БюджетПоМесяцам.Записывать = Истина;
	
	// 1. доходы ПП Лок
	Движение = Движения.БюджетПоМесяцам.Добавить();
	Движение.Период 			= Дата; // ДатаОплатыКлиента;
	Движение.ЗадачаПроекта		= ЗадачаПроекта;
	Движение.СтатьяСметы 		= Справочники.СтатьиСметы.ДоходыВс;
	// 
	Движение.ТипСуммы 			= Перечисления.ТипСуммыБюджета.ПервичныйДокумент;  // первичка
	Движение.Месяц	 			= НачалоМесяца( ДатаОплатыКлиента );  
	Движение.Сумма				= СуммаДопОтКлиента + Товар.Итог("СуммаПП");

	// 2 расходы на покупку ПП ЛО 
	Движение = Движения.БюджетПоМесяцам.Добавить();
	Движение.Период 			= Дата;
	Движение.ЗадачаПроекта		= ЗадачаПроекта;
	Движение.СтатьяСметы		= Справочники.СтатьиСметы.РасходыППЛО;
	// 
	Движение.ТипСуммы 			= Перечисления.ТипСуммыБюджета.ПервичныйДокумент;  // первичка
	Движение.Месяц	 			= НачалоМесяца( ДатаОплатыПравообладателю );  
	Движение.Сумма 				= Товар.Итог("СуммаПравоОбл") - СуммаДопОтВендора;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Если УП_СметаПроекта.Есть_СметаЗадачи_СодержащаяДокумент( Ссылка ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// перенос
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.ЗадачаПроекта.Владелец ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры
